const verificationInfo = {
    '001': {
        description: '手机号校验',
        regExp: /^1[3|4|5|6|7|8|9][0-9]{9}$/,
        error: '格式错误，请重新输入'
    },
    '002': {
        description: 'URL地址校验',
        regExp: /^http[s]?:\/\/.*/,
        error: 'URL地址格式错误，请重新输入'
    },
    '003': {
        description: '座机号校验',
        regExp: /0\d{2}-\d{7,8}/,
        error: '格式错误，请重新输入'
    },
    '004': {
        description: '身份证校验',
        regExp: /^[1-9]\d{5}(?:18|19|20)\d{2}(?:0[1-9]|10|11|12)(?:0[1-9]|[1-2]\d|30|31)\d{3}[\dXx]$/,
        error: '格式错误，请重新输入'
    },
    '005': {
        description: '密码校验', //密码以字母开头，长度在6~18之间，只能包含字母、数字和下划线
        regExp: /^[a-zA-Z]\w{5,17}$/,
        error: '格式错误，请重新输入'
    },
    '006': {
        description: '邮政编码校验',
        regExp: /[1-9]\d{5}(?!\d)/,
        error: '邮政编码格式错误，请重新输入'
    },
    '007': {
        description: 'QQ号校验',
        regExp: /^[1-9][0-9]{4,9}$/,
        error: 'QQ号格式错误，请重新输入'
    },
    '008': {
        description: '邮箱校验',
        regExp: /^[\w-]+(\.[\w-]+)*@[\w-]+(\.[\w-]+)+$/,
        error: '格式错误，请重新输入'
    },
    '009': {
        description: '金额校验',  //金额(小数点2位)
        regExp: /^\d*(?:\.\d{0,2})?$/,
        error: '格式错误，请重新输入'
    },
    '010': {
        description: '网址校验',
        regExp: /(http|ftp|https):\/\/[\w\-_]+(\.[\w\-_]+)+([\w\-\.,@?^=%&:/~\+#]*[\w\-\@?^=%&/~\+#])?/,
        error: '格式错误，请重新输入'
    },
    '011': {
        description: 'IP校验',
        regExp: /((?:(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d)\\.){3}(?:25[0-5]|2[0-4]\\d|[01]?\\d?\\d))/,
        error: '格式错误，请重新输入'
    },
    '012': {
        description: '日期时间校验',
        regExp: /^(\d{4})\-(\d{2})\-(\d{2}) (\d{2})(?:\:\d{2}|:(\d{2}):(\d{2}))$/,
        error: '格式错误，请重新输入'
    },
    '013': {
        description: '日期校验',
        regExp: /^(\d{4})\-(\d{2})\-(\d{2})$/,
        error: '格式错误，请重新输入'
    },
    '014': {
        description: '特殊字符校验',
        // regExp:/[`~!@#$^&*()=|{}':;',\[\].<>《》/?~！@#￥……&*（）——|{}【】‘；：”“'。，、？]/,
        regExp: /[`~#$^&()=|{}\'\[\]<>]/,
        //  regExp:/[`<>]/,
        error: '输入内容包含特殊字符，请重新输入'
    },
    '015': {
        description: 'HTML标记校验',
        regExp: /<("[^"]*"|'[^']*'|[^'">])*>/,
        error: 'HTML标记格式错误，请重新输入'
    },
    '016': {
        description: '银行卡校验',
        regExp: /^([1-9]{1})(\d{15}|\d{17}|\d{18})$/,
        error: '银行卡格式错误，请重新输入'
    },
    '017': {
        description: '经度校验',
        regExp: /(\-|\+)?(((\d|[1-9]\d|1[0-7]\d|0{1,3})\.\d{0,6})|(\d|[1-9]\d|1[0-7]\d|0{1,3})|180\.0{0,6}|180)$/,
        error: '经度格式错误，请重新输入'
    },
    '018': {
        description: '纬度校验',
        regExp: /(\-|\+)?([0-8]?\d{1}\.\d{0,6}|90\.0{0,6}|[0-8]?\d{1}|90)$/,
        error: '纬度格式错误，请重新输入'
    },
    '019': {
        description: '车牌号校验',
        regExp: /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领A-Z]{1}[A-Z]{1}[A-Z0-9]{5}$/,
        error: '格式错误，请重新输入'
    },
    '020': {
        description: '微信号校验',
        regExp: /^[a-zA-Z0-9_-]+$/,
        error: '格式错误，请重新输入'
    },
    '021': {
        description: '用户名称校验',
        regExp: /^[\u4E00-\u9FA5\uFF00-\uFFFF\u0000-\u00FF0-9A-Za-z·]{2,120}$/,
        error: '格式错误，请重新输入'
    },
    '022': {
        description: '姓名校验',
        regExp: /^[\u4E00-\u9FA5,A-Za-z.·]+$/,
        error: '格式错误，请重新输入'
    },
    '023': {
        description: '数字或者数字小数点校验',
        regExp: /^\d+(\.\d+)?$/,
        error: '格式错误，请重新输入'
    },
    '024': {
        description: '15~20位的数字校验（纳税人识别编号）',
        regExp: /^\d{15,20}$/,
        error: '为15~20位的数字，请重新输入'
    },
    '025': {
        description: '15~19位的数字校验（银行账号）',
        regExp: /^\d{15,19}$/,
        error: '为15~19位的数字，请重新输入'
    },
    '026': {
        description: '数字和大写英文校验（统一社会信用代码）',
        regExp: /^[0-9A-Z]+$/,
        error: '格式错误，请重新输入'
    },


    '800': {
        description: '数字校验',
        regExp: /^([0-9])*$/,
        error: '数字格式错误，请重新输入'
    },
    '801': {
        description: '英文校验',
        regExp: /^[a-zA-Z]+$/,
        error: '英文格式错误，请重新输入'
    },
    '802': {
        description: '中文校验',
        regExp: /^[\u4E00-\u9FA5]/,
        error: '中文格式错误，请重新输入'
    },
    '803': {
        description: '小写校验',
        regExp: /^[a-z]+$/,
        error: '小写格式错误，请重新输入'
    },
    '804': {
        description: '小写+反斜杠校验',
        regExp: /^[a-z\/]+$/,
        error: '小写+反斜杠格式错误，请重新输入'
    },
    '805': {
        description: '大写校验',
        regExp: /^[A-Z]+$/,
        error: '大写格式错误，请重新输入'
    },
    '806': {
        description: '空格校验',
        regExp: /\s/,
        error: '空格格式错误，请重新输入'
    },
    '807': {
        description: '中文校验',  //电综 
        regExp: /^[\u4E00-\u9FA5,A-Za-z.·]+$/,
        error: '格式填写错误,不可输入中文以外的字符'
    },
    '808': {
        description: '资产编号校验',
        regExp: /(^\d{10}$)|(^\d{16}$)|(^\d{22}$)/,
        error: '必须为十位或十六位或者二十二位的数字'
    },
    '809': {
        description: '资产编号校验',
        regExp: /(^\d{10}$)/,
        error: '必须为十位的数字'
    },
    '1003': {
        // 普查座机号校验
        description: '座机号校验',
        regExp: /0\d{2,3}-\d{7,8}/,
        error: '格式错误，请重新输入'
    },
}
export default verificationInfo;